app/controllers/pages_controller.rb

SELECT * FROM `pages`
---
  def index
    @pages = Page.all

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def show
    @page = Page.find(params[:id])

INSERT INTO `pages` (`name`, `permalink`, `updated_at`, `title`, `content`, `created_at`) VALUES('about', 'about us', '2009-04-14 10:30:54', 'about us', 'test', '2009-04-14 10:30:54')
---
  def create
    @page = Page.new(params[:page])
    if @page.save

SELECT * FROM `pages` WHERE (`pages`.`id` = 2)
---
  def edit
    @page = Page.find(params[:id])